# 4K-NeRF: High Fidelity Neural Radiance Fields at Ultra High Resolutions
## Abstract
在本文中，我们提出了一种新颖而有效的框架，称为4K-NeRF，以神经辐射场(NeRF)的方法为基础，在超高分辨率的挑战性场景上追求高保真视图合成。

基于nerf方法的渲染过程通常依赖于一种像素方式，在这种方式中，射线(或像素)在训练和推断阶段都是独立处理的，这限制了其描述微妙细节的表示能力，特别是当提升到极高分辨率时。

我们通过更好地探索射线相关性来解决这个问题，以增强受益于几何感知局部上下文的高频细节。

特别地，我们使用视域一致编码器在低分辨率空间中有效地建模地测量信息，并通过视域一致解码器恢复细节，条件是编码器估计的光线特征和深度。

联合训练和基于补丁的采样进一步促进了我们的方法，结合了超越像素损失的面向感知的正则化监督。

与现代NeRF方法的定量和定性比较表明，我们的方法可以显著提高保留高频细节的渲染质量，在4K超高分辨率场景中实现最先进的视觉质量。

## Introduction
超高分辨率作为记录和显示图像和视频的标准越来越受欢迎，甚至在现代移动设备中也得到了支持。

与使用相对较低的分辨率相比，超高分辨率格式捕捉的场景通常会呈现令人难以置信的内容细节(例如，1K高清格式)，其中像素的信息在极高分辨率的图像中通过一个小补丁放大。

开发处理这些高频细节的技术对图像处理和计算机视觉的广泛任务提出了挑战。

在本文中，我们重点研究了一种新颖的视图合成任务，并研究了在超高分辨率下实现富含细微细节的高保真视图合成的潜力。
